<template>
  <div class="white-container data-processing-consent">
    <div class="content">
      <h1>Согласие на обработку персональных данных</h1>
      <div class="paragraph">
        Предоставляя свои персональные данные Пользователь даёт согласие на обработку,
        хранение и использование своих персональных данных на основании
        ФЗ № 152-ФЗ «О персональных данных» от 27.07.2006 г. в целях осуществления связи с клиентом.
      </div>
      <div class="paragraph">
        Под персональными данными подразумевается любая информация личного характера,
        позволяющая установить личность Пользователя/Покупателя такая как:
        <ul>
          <li>Фамилия, Имя</li>
          <li>Контактный телефон</li>
          <li>Адрес электронной почты</li>
        </ul>
      </div>
      <div class="paragraph">
        Персональные данные Пользователей хранятся исключительно на электронных
        носителях и подвергаются неавтоматизированной обработке.
      </div>
      <div class="paragraph">
        ИП Кириллов М.А. обязуется не передавать полученные персональные данные третьим лицам,
        за исключением следующих случаев:
        <ul>
          <li>По запросам уполномоченных органов государственной власти РФ только
          по основаниям и в порядке, установленным законодательством РФ</li>
        </ul>
      </div>
      <div class="paragraph">
        ИП Кириллов М.А. оставляет за собой право вносить изменения в одностороннем
        порядке в настоящие правила, при условии, что изменения не противоречат
        действующему законодательству РФ. Изменения условий настоящих правил
        вступают в силу после их публикации на Сайте.
      </div>
    </div>
  </div>
</template>
<style scoped>
.content {
  max-width: 700px;
  margin: 0 auto;
  overflow-x: auto;
}
</style>
<script>
export default {
  asyncData({ app, params, store }) {
    store.commit('setTitle', 'Согласие на обработку персональных данных');
  },
};
</script>
