<template>
  <div class="white-container data-processing-consent">
    <div class="content">
      <h1>Политика конфиденциальности</h1>
      <ol>
        <h2><li>Обрабатываемые данные</li></h2>
        <ol>
          <li>Мы осуществляем сбор как персональных, так и других данных
          с использованием Сайта.</li>
          <li>Собираемые данные включают следующие сведения:</li>
          <ol>
            <li>Информацию, которую вы предоставляете о себе самостоятельно
            с использованием онлайн-форм и программных модулей Сайта,
            включая имя или номер телефона и/или адрес электронной почты.</li>
            <li>Данные, которые передаются в обезличенном виде в автоматическом
            режиме в зависимости от настроек используемого вами программного
            обеспечения.</li>
          </ol>
          <li>Администрация вправе устанавливать требования к составу Обезличенных
          данных Пользователя, которые собираются использованием Сайта.</li>
          <li>Администрация не осуществляет проверку достоверности предоставляемых данных и наличия у Пользователя необходимого согласия на их обработку в соответствии с настоящей Политикой, полагая, что Пользователь действует добросовестно, осмотрительно и прилагает все необходимые усилия к поддержанию такой информации в актуальном состоянии и получению всех необходимых согласий на ее использование.</li>
          <li>Вы осознаете и принимаете возможность использования на Сайте программного обеспечения третьих лиц, в результате чего такие лица могут получать и передавать указанные в п.1.3 данные в обезличенном виде.</li>
          <li>Состав и условия сбора обезличенных данных с использованием программного обеспечения третьих лиц определяются непосредственно их правообладателями и могут включать:</li>
          <ul>
            <li>данные браузера (тип, версия, cookie);</li>
            <li>данные устройства и место его положения;</li>
            <li>данные операционной системы (тип, версия, разрешение экрана);</li>
            <li>данные запроса (время, источник перехода, IP-адрес).</li>
          </ul>
        </ol>
        <h2><li>Цели обработки данных</li></h2>
        <ol>
          <li>Администрация использует данные в целях обработки
          поступающих запросов и связи с Пользователем</li>
        </ol>
        <h2><li>Требования к защите данных</li></h2>
        <ol>
          <li>Администрация осуществляет хранение данных и обеспечивает их охрану от несанкционированного доступа и распространения в соответствии с внутренними правилами и регламентами.</li>
          <li>В отношении полученных данных сохраняется конфиденциальность, за исключением случаев, когда они сделаны Пользователем общедоступными, а также когда используемые на Сайте технологии и программное обеспечение третьих лиц либо настройки используемого Пользователем программного обеспечения предусматривают открытый обмен с данными лицами и/или иными участниками и пользователями сети Интернет.</li>
          <li>В целях повышения качества работы Администрация вправе хранить лог-файлы о действиях, совершенных Пользователем в рамках использования Сайта в течение 1 (Одного) года.</li>
        </ol>
        <h2><li>Передача данных</li></h2>
        <ol>
          <li>Администрация вправе передать данные третьим лицам в следующих случаях:</li>
          <ul>
            <li>Пользователь выразил свое согласие на такие действия, включая случаи применения Пользователем настроек используемого программного обеспечения, не ограничивающих предоставление определенной информации;</li>
            <li>Передача необходима в рамках использования Пользователем функциональных возможностей Сайта;</li>
            <li>Передача требуется в соответствии с целями обработки данных;</li>
            <li>В связи с передачей Сайта во владение, пользование или собственность такого третьего лица;</li>
            <li>По запросу суда или иного уполномоченного государственного органа в рамках установленной законодательством процедуры;</li>
            <li>Для защиты прав и законных интересов Администрации в связи с допущенными Пользователем нарушениями.</li>
          </ul>
        </ol>
        <ol>
          <li>Администрация осуществляет хранение данных и обеспечивает их охрану от несанкционированного доступа и распространения в соответствии с внутренними правилами и регламентами.</li>
        </ol>
        <h2><li>Изменение Политики конфиденциальности</li></h2>
        <ol>
          <li>Настоящая Политика может быть изменена или прекращена Администрацией в одностороннем порядке без предварительного уведомления Пользователя. Новая редакция Политики вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики.</li>
        </ol>
      </ol>
    </div>
  </div>
</template>
<style scoped>
ol {
  counter-reset: item;
}

ol, ul {
  list-style: inside;
}

li:not(ul li) {
  display: flex;
  margin: 10px 0;
}

li:not(ul li)::before {
  display: block;
  padding-right: 10px;
  content: counters(item, ".") ". ";
  counter-increment: item
}
</style>
<script>
export default {
  asyncData({ store }) {
    store.commit('setTitle', 'Политика конфиденциальности');
  },
};
</script>
